Статистика работы механизмов/Конфигурация/DataProcessors/_ОткрытиеФайловИзExternals.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОткрытиеФайловИзExternals</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ОткрытиеФайловИзExternals/_ОткрытиеФайловИзExternals/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьСписокИсточников();
	ЗаполнитьСписокФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИсточников()
	
	Элементы.Источник.СписокВыбора.Очистить();	
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Значение"		, Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Представление", Новый ОписаниеТипов("Строка"));
	
	ТекстЗапроса = 
		"SELECT 
		|	[Id] AS Значение,
		|	[Source_Name] AS Представление
		|FROM 
		|	[Externals].[dbo].[Data_Sources]";

	РезультатЗапроса = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если РезультатЗапроса <> Неопределено Тогда
		Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
			Элементы.Источник.СписокВыбора.Добавить(СтрокаРезультата.Значение, Строка(СтрокаРезультата.Значение) + ". " + СтрокаРезультата.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокФайлов()
	
	Если Не ЗначениеЗаполнено(Объект.Источник) Тогда
		Объект.ТаблицаФайлов.Очистить();
		Возврат;
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Идентификатор", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("ИмяФайла"		, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ВремяЗагрузки", Новый ОписаниеТипов("Дата"));
	ТипыКолонок.Вставить("РазмерФайла"	, Новый ОписаниеТипов("Число"));
	
	ТекстЗапроса = 
		"SELECT 
		|	[Id] AS Идентификатор,
		|	[File_Name] AS ИмяФайла,
		|	[Upload_Time] AS ВремяЗагрузки,
		|	DATALENGTH([File_Data]) / 1024 AS РазмерФайла
		|FROM 
		|	[Externals].[dbo].[Files]
		|Where
		|	Source_Id = &Source_Id
		|	AND ([Organization] = '&Organization' OR [Organization] IS NULL)
		|Order by
		|	[Id]";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Source_Id"	, Объект.Источник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Organization", Строка(Объект.Организация.УникальныйИдентификатор()));
	
	РезультатЗапроса = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если РезультатЗапроса <> Неопределено Тогда
		Объект.ТаблицаФайлов.Загрузить(РезультатЗапроса);
	Иначе
		Объект.ТаблицаФайлов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	Объект.ТаблицаФайлов.Очистить();	
	
	Если ЗначениеЗаполнено(Объект.Источник) Тогда
		ЗаполнитьСписокФайлов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	// Получаем имя файла
	
	ИмяФайла = ТекущиеДанные.ИмяФайла;
	
	Если Найти(ИмяФайла, "/") > 0 Тогда
		ЧастиИмениФайла = СтрРазделить(ИмяФайла, "/");
		ИмяФайла = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
	КонецЕсли;
	
	ИмяФайла = РаботаСФайламиКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	
	ИмяВременногоФайла = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + ИмяФайла;
	
	// Получаем данные и сохраняем в каталоге временных файлов
	
	ДвоичныеДанные = ПолучитьДанныеФайла(ТекущиеДанные.Идентификатор);
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		Попытка
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			ЗапуститьПриложение(ИмяВременногоФайла);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось открыть файл %1, возможно он уже открыт", ИмяВременногоФайла));
		КонецПопытки;
	Иначе
		ВызватьИсключение "Ошибка получения файла из Externals!";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Идентификатор)
	
	Возврат РаботаСВнешнимиСистемами.ПолучитьФайлИзExternals(Идентификатор);
	
КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	
	// Обновляем источники	
	
	ЗаполнитьСписокИсточников();
	
	Если Элементы.Источник.СписокВыбора.НайтиПоЗначению(Объект.Источник) = Неопределено Тогда
		Объект.Источник = Неопределено;
	КонецЕсли;
	
	// Обновляем файлы
	
	ЗаполнитьСписокФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	Попытка
		ВыполнитьКомандаОбновить(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаОбновить(ПараметрыСессии)
	
	ТекущийИсточник		= Объект.Источник;
	ТекущийФайл			= Элементы.ТаблицаФайлов.ТекущиеДанные;
	ИдентификаторФайла	= ?(ТекущийФайл = Неопределено, Неопределено, ТекущийФайл.Идентификатор);
	
	ОбновитьНаСервере();
	
	Если Объект.Источник = ТекущийИсточник И ЗначениеЗаполнено(ИдентификаторФайла) Тогда
		СтрокиФайлов = Объект.ТаблицаФайлов.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторФайла));
		Если СтрокиФайлов.Количество() > 0 Тогда
			Элементы.ТаблицаФайлов.ТекущаяСтрока = СтрокиФайлов[0].ПолучитьИдентификатор();		
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");

	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);

	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);

	Возврат ПараметрыСессии;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);

КонецПроцедуры

#КонецОбласти
